import React from "react";

import Header from "../layouts/Header";

const Home = () => {
  return (
    <div>
      <Header />
      <p>
        Training Management Center: TMC
        พร้อมดูแลทุกท่านในการจัดทำแผนพัฒนาศักยภาพรายบุคคล (Individual
        Development Plan: IDP) ประจำปี 2026
        หากท่านพบปัญหาหรือมีข้อสงสัยในกรณีดังต่อไปนี้
        สามารถติดต่อทีมงานของเราได้ทันที: 1. ปัญหาการเข้าสู่ระบบ (Technical
        Assistance & Access) ไม่สามารถเข้าสู่ระบบ StarMeter ได้
        ระบบหมดเวลาเชื่อมต่อ (System Timeout)
        หรือเกิดข้อผิดพลาดขณะบันทึกข้อมูลเป้าหมาย หน้าแดชบอร์ด (Dashboard)
        แสดงผลไม่ถูกต้อง 2. สอบถามข้อมูลการตั้งเป้าหมายและการประเมินผลงาน
        (Performance & Goal Setting Inquiries)
        มีข้อสงสัยเกี่ยวกับขั้นตอนการส่งและการอนุมัติ IDP
        ต้องการคำแนะนำในการค้นหาหลักสูตรการเรียนรู้เพื่อแนบในแผนพัฒนาตนเอง 3.
        การแก้ไขข้อมูลส่วนตัวและข้อมูลในระบบ (Data & Profile Corrections)
        ข้อมูลในโปรไฟล์ส่วนตัวไม่ถูกต้อง เช่น ตำแหน่งงานไม่อัปเดต,
        แผนกไม่ถูกต้อง หรือผู้บังคับบัญชา (Reporting Manager) ไม่ถูกต้อง
        (เนื่องจากการระบุสายการรายงานที่ถูกต้องมีความสำคัญอย่างยิ่ง
        เพื่อให้ระบบส่ง IDP ไปยังผู้อนุมัติได้ถูกต้อง)
        ประวัติการฝึกอบรมหรือใบรับรอง (Certifications)
        ในอดีตสูญหายหรือไม่แสดงในโปรไฟล์ ช่องทางการติดต่อ (How to Reach Us)
        หากท่านพบปัญหาตามข้างต้น
        หรือมีข้อสงสัยทั่วไปเกี่ยวกับการเรียนรู้และการประเมินผลงานบนแพลตฟอร์ม
        สามารถส่งอีเมลถึงศูนย์บริหารการจัดการการฝึกอบรม (TMC) ได้ที่:
        taa_learning@airasia.com ข้อแนะนำสำหรับการติดต่อ:
        เพื่อความรวดเร็วในการประสานงานและแก้ไขปัญหา
        กรุณาระบุข้อมูลต่อไปนี้ในอีเมลของท่าน: ชื่อ-นามสกุล รหัสพนักงาน
        (Employee ID) รายละเอียดของปัญหาหรือข้อสงสัยโดยสังเขป
      </p>
    </div>
  );
};

export default Home;
